# Project 14 - Advanced Pandas String Functions Tutorial

In [1]:
import pandas as pd

In [2]:
data = {
    'Name' : ['Adrian Crassers', 'Robertson Castello', 'Jordan Frost', 'Ariel Vespellani', 'Carly Doneldson'],
    'City' : [' Clearwater ', ' Albuquerque ', ' San Francisco', 'Albany ', ' Vail'],
    'State': ['FL', 'NM', 'CA', 'NY', 'CO']
}

In [3]:
df_mockup = pd.DataFrame(data)

df_mockup

                 Name            City State
0     Adrian Crassers     Clearwater     FL
1  Robertson Castello    Albuquerque     NM
2        Jordan Frost   San Francisco    CA
3    Ariel Vespellani         Albany     NY
4     Carly Doneldson            Vail    CO

## 1. str.lower()

In [4]:
df_mockup['Name']

0       Adrian Crassers
1    Robertson Castello
2          Jordan Frost
3      Ariel Vespellani
4       Carly Doneldson
Name: Name, dtype: object

In [5]:
df_mockup['Name Lower'] = df_mockup['Name'].str.lower()

df_mockup['Name Lower']

0       adrian crassers
1    robertson castello
2          jordan frost
3      ariel vespellani
4       carly doneldson
Name: Name Lower, dtype: object

In [6]:
df_mockup['Name Upper'] = df_mockup['Name'].str.upper()

df_mockup['Name Upper']

0       ADRIAN CRASSERS
1    ROBERTSON CASTELLO
2          JORDAN FROST
3      ARIEL VESPELLANI
4       CARLY DONELDSON
Name: Name Upper, dtype: object

In [7]:
df_mockup

,Name,City,State,Name Lower,Name Upper
0,Adrian Crassers,Clearwater,FL,adrian crassers,ADRIAN CRASSERS
1,Robertson Castello,Albuquerque,NM,robertson castello,ROBERTSON CASTELLO
2,Jordan Frost,San Francisco,CA,jordan frost,JORDAN FROST
3,Ariel Vespellani,Albany,NY,ariel vespellani,ARIEL VESPELLANI
4,Carly Doneldson,Vail,CO,carly doneldson,CARLY DONELDSON

## 2. str.len()

In [8]:
df_mockup['Name Length'] = df_mockup['Name'].str.len()

df_mockup

,Name,City,State,Name Lower,Name Upper,Name Length
0,Adrian Crassers,Clearwater,FL,adrian crassers,ADRIAN CRASSERS,15
1,Robertson Castello,Albuquerque,NM,robertson castello,ROBERTSON CASTELLO,18
2,Jordan Frost,San Francisco,CA,jordan frost,JORDAN FROST,12
3,Ariel Vespellani,Albany,NY,ariel vespellani,ARIEL VESPELLANI,16
4,Carly Doneldson,Vail,CO,carly doneldson,CARLY DONELDSON,15

## 3. str.strip()

In [10]:
df_mockup['City']

0       Clearwater
1      Albuquerque
2     San Francisco
3           Albany
4              Vail
Name: City, dtype: object

In [11]:
df_mockup['City'][2]

' San Francisco'

In [9]:
df_mockup['City'].str.len()

0    12
1    13
2    14
3     7
4     5
Name: City, dtype: int64

In [13]:
df_mockup['City Stripped'] = df_mockup['City'].str.strip()

df_mockup

,Name,City,State,Name Lower,Name Upper,Name Length,City Stripped
0,Adrian Crassers,Clearwater,FL,adrian crassers,ADRIAN CRASSERS,15,Clearwater
1,Robertson Castello,Albuquerque,NM,robertson castello,ROBERTSON CASTELLO,18,Albuquerque
2,Jordan Frost,San Francisco,CA,jordan frost,JORDAN FROST,12,San Francisco
3,Ariel Vespellani,Albany,NY,ariel vespellani,ARIEL VESPELLANI,16,Albany
4,Carly Doneldson,Vail,CO,carly doneldson,CARLY DONELDSON,15,Vail

In [14]:
df_mockup['City Stripped']

0       Clearwater
1      Albuquerque
2    San Francisco
3           Albany
4             Vail
Name: City Stripped, dtype: object

In [16]:
df_mockup['City Stripped'][2]

'San Francisco'

In [15]:
df_mockup['City Stripped'].str.len()

0    10
1    11
2    13
3     6
4     4
Name: City Stripped, dtype: int64

### 3.1. str.lstrip()

In [17]:
df_mockup['City'][0]

' Clearwater '

In [18]:
df_mockup['City Left Stripped'] = df_mockup['City'].str.lstrip()

In [19]:
df_mockup['City Left Stripped'][0]

'Clearwater '

### 3.2. rstrip()

In [22]:
df_mockup['City'][1]

' Albuquerque '

In [20]:
df_mockup['City Right Stripped'] = df_mockup['City'].str.rstrip()

In [21]:
df_mockup['City Right Stripped'][1]

' Albuquerque'

## 4. str.split()

In [23]:
df_mockup

,Name,City,State,Name Lower,Name Upper,Name Length,City Stripped,City Left Stripped,City Right Stripped
0,Adrian Crassers,Clearwater,FL,adrian crassers,ADRIAN CRASSERS,15,Clearwater,Clearwater,Clearwater
1,Robertson Castello,Albuquerque,NM,robertson castello,ROBERTSON CASTELLO,18,Albuquerque,Albuquerque,Albuquerque
2,Jordan Frost,San Francisco,CA,jordan frost,JORDAN FROST,12,San Francisco,San Francisco,San Francisco
3,Ariel Vespellani,Albany,NY,ariel vespellani,ARIEL VESPELLANI,16,Albany,Albany,Albany
4,Carly Doneldson,Vail,CO,carly doneldson,CARLY DONELDSON,15,Vail,Vail,Vail

In [24]:
df_mockup['Name']

0       Adrian Crassers
1    Robertson Castello
2          Jordan Frost
3      Ariel Vespellani
4       Carly Doneldson
Name: Name, dtype: object

In [25]:
df_mockup[['First Name', 'Last Name']] = df_mockup['Name'].str.split(' ', expand=True)

df_mockup

,Name,City,State,Name Lower,Name Upper,Name Length,City Stripped,City Left Stripped,City Right Stripped,First Name,Last Name
0,Adrian Crassers,Clearwater,FL,adrian crassers,ADRIAN CRASSERS,15,Clearwater,Clearwater,Clearwater,Adrian,Crassers
1,Robertson Castello,Albuquerque,NM,robertson castello,ROBERTSON CASTELLO,18,Albuquerque,Albuquerque,Albuquerque,Robertson,Castello
2,Jordan Frost,San Francisco,CA,jordan frost,JORDAN FROST,12,San Francisco,San Francisco,San Francisco,Jordan,Frost
3,Ariel Vespellani,Albany,NY,ariel vespellani,ARIEL VESPELLANI,16,Albany,Albany,Albany,Ariel,Vespellani
4,Carly Doneldson,Vail,CO,carly doneldson,CARLY DONELDSON,15,Vail,Vail,Vail,Carly,Doneldson

## 5. str.contains()

In [26]:
df_mockup['Name'].str.contains('Frost')

0    False
1    False
2     True
3    False
4    False
Name: Name, dtype: bool

In [27]:
df_mockup[df_mockup['Name'].str.contains('Frost')]

,Name,City,State,Name Lower,Name Upper,Name Length,City Stripped,City Left Stripped,City Right Stripped,First Name,Last Name
2,Jordan Frost,San Francisco,CA,jordan frost,JORDAN FROST,12,San Francisco,San Francisco,San Francisco,Jordan,Frost

In [28]:
df_mockup['Name'].str.contains('Frost', case=False)

0    False
1    False
2     True
3    False
4    False
Name: Name, dtype: bool

In [29]:
df_mockup[df_mockup['Name'].str.contains('Frost', case=False)]

,Name,City,State,Name Lower,Name Upper,Name Length,City Stripped,City Left Stripped,City Right Stripped,First Name,Last Name
2,Jordan Frost,San Francisco,CA,jordan frost,JORDAN FROST,12,San Francisco,San Francisco,San Francisco,Jordan,Frost

## 6. str.replace()

In [30]:
df_mockup['State']

0    FL
1    NM
2    CA
3    NY
4    CO
Name: State, dtype: object

In [31]:
df_mockup['State'].str.replace('NY', 'New York')

0          FL
1          NM
2          CA
3    New York
4          CO
Name: State, dtype: object

In [92]:
df_mockup['State Full'] = df_mockup['State'].str.replace('FL', 'Florida')
# chaining str.replace()
df_mockup['State Full'] = df_mockup['State'].str.replace('NY', 'New York').str.replace('CO', 'Colorado')

In [93]:
df_mockup

,Name,City,State,Name Lower,Name Upper,Name Length,City Stripped,City Left Stripped,City Right Stripped,First Name,Last Name,State Full
0,Adrian Crassers,Clearwater,FL,adrian crassers,ADRIAN CRASSERS,15,Clearwater,Clearwater,Clearwater,Adrian,Crassers,FL
1,Robertson Castello,Albuquerque,NM,robertson castello,ROBERTSON CASTELLO,18,Albuquerque,Albuquerque,Albuquerque,Robertson,Castello,NM
2,Jordan Frost,San Francisco,CA,jordan frost,JORDAN FROST,12,San Francisco,San Francisco,San Francisco,Jordan,Frost,CA
3,Ariel Vespellani,Albany,NY,ariel vespellani,ARIEL VESPELLANI,16,Albany,Albany,Albany,Ariel,Vespellani,New York
4,Carly Doneldson,Vail,CO,carly doneldson,CARLY DONELDSON,15,Vail,Vail,Vail,Carly,Doneldson,Colorado

In [94]:
states = {'FL' : 'Florida',
          'NM' : 'New Mexico',
          'CA' : 'California',
          'NY' : 'New York',
          'CO' : 'Colorado'}

In [95]:
df_mockup['State Full'] = df_mockup['State'].map(states)

In [96]:
df_mockup

,Name,City,State,Name Lower,Name Upper,Name Length,City Stripped,City Left Stripped,City Right Stripped,First Name,Last Name,State Full
0,Adrian Crassers,Clearwater,FL,adrian crassers,ADRIAN CRASSERS,15,Clearwater,Clearwater,Clearwater,Adrian,Crassers,Florida
1,Robertson Castello,Albuquerque,NM,robertson castello,ROBERTSON CASTELLO,18,Albuquerque,Albuquerque,Albuquerque,Robertson,Castello,New Mexico
2,Jordan Frost,San Francisco,CA,jordan frost,JORDAN FROST,12,San Francisco,San Francisco,San Francisco,Jordan,Frost,California
3,Ariel Vespellani,Albany,NY,ariel vespellani,ARIEL VESPELLANI,16,Albany,Albany,Albany,Ariel,Vespellani,New York
4,Carly Doneldson,Vail,CO,carly doneldson,CARLY DONELDSON,15,Vail,Vail,Vail,Carly,Doneldson,Colorado

## 7. str.startswith() and str.endswith()

In [97]:
df_mockup['First Name'].str.startswith('A')

0     True
1    False
2    False
3     True
4    False
Name: First Name, dtype: bool

In [98]:
df_mockup[df_mockup['First Name'].str.startswith('A')]

,Name,City,State,Name Lower,Name Upper,Name Length,City Stripped,City Left Stripped,City Right Stripped,First Name,Last Name,State Full
0,Adrian Crassers,Clearwater,FL,adrian crassers,ADRIAN CRASSERS,15,Clearwater,Clearwater,Clearwater,Adrian,Crassers,Florida
3,Ariel Vespellani,Albany,NY,ariel vespellani,ARIEL VESPELLANI,16,Albany,Albany,Albany,Ariel,Vespellani,New York

In [99]:
df_mockup['Last Name'].str.endswith('o')

0    False
1     True
2    False
3    False
4    False
Name: Last Name, dtype: bool

In [100]:
df_mockup[df_mockup['Last Name'].str.endswith('o')]

,Name,City,State,Name Lower,Name Upper,Name Length,City Stripped,City Left Stripped,City Right Stripped,First Name,Last Name,State Full
1,Robertson Castello,Albuquerque,NM,robertson castello,ROBERTSON CASTELLO,18,Albuquerque,Albuquerque,Albuquerque,Robertson,Castello,New Mexico

## 8. str.cat()

In [101]:
df_mockup

,Name,City,State,Name Lower,Name Upper,Name Length,City Stripped,City Left Stripped,City Right Stripped,First Name,Last Name,State Full
0,Adrian Crassers,Clearwater,FL,adrian crassers,ADRIAN CRASSERS,15,Clearwater,Clearwater,Clearwater,Adrian,Crassers,Florida
1,Robertson Castello,Albuquerque,NM,robertson castello,ROBERTSON CASTELLO,18,Albuquerque,Albuquerque,Albuquerque,Robertson,Castello,New Mexico
2,Jordan Frost,San Francisco,CA,jordan frost,JORDAN FROST,12,San Francisco,San Francisco,San Francisco,Jordan,Frost,California
3,Ariel Vespellani,Albany,NY,ariel vespellani,ARIEL VESPELLANI,16,Albany,Albany,Albany,Ariel,Vespellani,New York
4,Carly Doneldson,Vail,CO,carly doneldson,CARLY DONELDSON,15,Vail,Vail,Vail,Carly,Doneldson,Colorado

In [102]:
df_mockup['First Name'].str.cat(df_mockup['Last Name'], sep=' ')

0       Adrian Crassers
1    Robertson Castello
2          Jordan Frost
3      Ariel Vespellani
4       Carly Doneldson
Name: First Name, dtype: object

In [105]:
df_mockup['Abbrev State'] = df_mockup['State'].str.cat(df_mockup['State Full'], sep=' : ')

In [106]:
df_mockup

,Name,City,State,Name Lower,Name Upper,Name Length,City Stripped,City Left Stripped,City Right Stripped,First Name,Last Name,State Full,Abbrev State
0,Adrian Crassers,Clearwater,FL,adrian crassers,ADRIAN CRASSERS,15,Clearwater,Clearwater,Clearwater,Adrian,Crassers,Florida,FL : Florida
1,Robertson Castello,Albuquerque,NM,robertson castello,ROBERTSON CASTELLO,18,Albuquerque,Albuquerque,Albuquerque,Robertson,Castello,New Mexico,NM : New Mexico
2,Jordan Frost,San Francisco,CA,jordan frost,JORDAN FROST,12,San Francisco,San Francisco,San Francisco,Jordan,Frost,California,CA : California
3,Ariel Vespellani,Albany,NY,ariel vespellani,ARIEL VESPELLANI,16,Albany,Albany,Albany,Ariel,Vespellani,New York,NY : New York
4,Carly Doneldson,Vail,CO,carly doneldson,CARLY DONELDSON,15,Vail,Vail,Vail,Carly,Doneldson,Colorado,CO : Colorado

## 9. str.get()

In [107]:
df_mockup.columns

Index(['Name', 'City', 'State', 'Name Lower', 'Name Upper', 'Name Length',
       'City Stripped', 'City Left Stripped', 'City Right Stripped',
       'First Name', 'Last Name', 'State Full', 'Abbrev State'],
      dtype='object')

In [108]:
df_mockup['Name'].str.get(0)

0    A
1    R
2    J
3    A
4    C
Name: Name, dtype: object

In [109]:
df_mockup['Name'].str.get(-1)

0    s
1    o
2    t
3    i
4    n
Name: Name, dtype: object

In [110]:
df_mockup['Name'].str.split()

0       [Adrian, Crassers]
1    [Robertson, Castello]
2          [Jordan, Frost]
3      [Ariel, Vespellani]
4       [Carly, Doneldson]
Name: Name, dtype: object

In [111]:
df_mockup['Name'].str.split().str.get(0)

0       Adrian
1    Robertson
2       Jordan
3        Ariel
4        Carly
Name: Name, dtype: object

In [112]:
df_mockup['Name'].str.split().str.get(-1)

0      Crassers
1      Castello
2         Frost
3    Vespellani
4     Doneldson
Name: Name, dtype: object

## 10. str.slice()

In [113]:
df_mockup

,Name,City,State,Name Lower,Name Upper,Name Length,City Stripped,City Left Stripped,City Right Stripped,First Name,Last Name,State Full,Abbrev State
0,Adrian Crassers,Clearwater,FL,adrian crassers,ADRIAN CRASSERS,15,Clearwater,Clearwater,Clearwater,Adrian,Crassers,Florida,FL : Florida
1,Robertson Castello,Albuquerque,NM,robertson castello,ROBERTSON CASTELLO,18,Albuquerque,Albuquerque,Albuquerque,Robertson,Castello,New Mexico,NM : New Mexico
2,Jordan Frost,San Francisco,CA,jordan frost,JORDAN FROST,12,San Francisco,San Francisco,San Francisco,Jordan,Frost,California,CA : California
3,Ariel Vespellani,Albany,NY,ariel vespellani,ARIEL VESPELLANI,16,Albany,Albany,Albany,Ariel,Vespellani,New York,NY : New York
4,Carly Doneldson,Vail,CO,carly doneldson,CARLY DONELDSON,15,Vail,Vail,Vail,Carly,Doneldson,Colorado,CO : Colorado

In [114]:
df_mockup['Last Name'].str.slice(3)

0      ssers
1      tello
2         st
3    pellani
4     eldson
Name: Last Name, dtype: object

In [118]:
df_mockup['Name State'] = df_mockup['First Name'].str.slice(0, 3) + ' ' + df_mockup['State']

In [119]:
df_mockup

,Name,City,State,Name Lower,Name Upper,Name Length,City Stripped,City Left Stripped,City Right Stripped,First Name,Last Name,State Full,Abbrev State,Name State
0,Adrian Crassers,Clearwater,FL,adrian crassers,ADRIAN CRASSERS,15,Clearwater,Clearwater,Clearwater,Adrian,Crassers,Florida,FL : Florida,Adr FL
1,Robertson Castello,Albuquerque,NM,robertson castello,ROBERTSON CASTELLO,18,Albuquerque,Albuquerque,Albuquerque,Robertson,Castello,New Mexico,NM : New Mexico,Rob NM
2,Jordan Frost,San Francisco,CA,jordan frost,JORDAN FROST,12,San Francisco,San Francisco,San Francisco,Jordan,Frost,California,CA : California,Jor CA
3,Ariel Vespellani,Albany,NY,ariel vespellani,ARIEL VESPELLANI,16,Albany,Albany,Albany,Ariel,Vespellani,New York,NY : New York,Ari NY
4,Carly Doneldson,Vail,CO,carly doneldson,CARLY DONELDSON,15,Vail,Vail,Vail,Carly,Doneldson,Colorado,CO : Colorado,Car CO

## 11. str.find(), str.rfind()

In [120]:
df_mockup['Name'].str.find('i')

0    3
1   -1
2   -1
3    2
4   -1
Name: Name, dtype: int64

In [122]:
df_mockup['State Full'].str.rfind('a')

0    6
1   -1
2    9
3   -1
4    5
Name: State Full, dtype: int64